/* Выведите с помощью этого массива следующую строку:'a+b+c+d'
let arr = ["a", "b", "c", "d"];
let str = arr.join("+");
console.log(str);//a+b+c+d */

//Создайте массив с числами. Прибавьте к каждому элементу массива число 3.
// Выведите на экран измененный массив.
/* let arr = [1, 2, 3];
arr[0] += 3;
arr[1] += 3;
arr[2] += 3;
console.log(arr);//[ 4, 5, 6 ] */

//Создайте массив с элементами 1, 2 и 3. С помощью оператора ++ увеличьте каждый элемент массива на единицу.
/* let arr = [1, 2, 3];
++arr[0];
++arr[1];
++arr[2];
console.log(arr);//[ 2, 3, 4 ] */

//Добавьте ему в конец элементы 4 и 5.
/* let arr = [1, 2, 3];
arr[3] = 4;
arr[4] = 5;
arr//[ 1, 2, 3, 4, 5 ] */

//Узнайте длину следующего массива:
/* let arr = [];

arr[3] = 'a';
arr[8] = 'b';
console.log(arr.length)//9 */

/* //Выведите на экран элемент, ключ которого хранится в переменной key.
let arr = ['a', 'b', 'c'];
let key = 2; // запишем ключ в переменную
console.log(arr[key]); // выведет 'c' */

//Найдите сумму элементов, ключи которых хранятся в наших переменных.
/* let arr = [1, 2, 3, 4, 5];
let key1 = 1;
let key2 = 2;
let sum = arr[key1] + arr[key2];
console.log(sum);//5 */

/* //Удалите из него два элемента. Проверьте, какое станет значение свойства length после этого.
let arr = ['a', 'b', 'c', 'd', 'e'];
delete arr[1];
delete arr[3];
console.log(arr);//[ 'a', , 'c', , 'e' ]
console.log(arr.length);//5 */

//Поиск ошибок в коде с массивами JavaScript
//Код должен вывести последний элемент массива:
/* let arr = [1, 2, 3, 4, 55];
console.log(arr[arr.length-1]);//55 */

//Код должен найти сумму элементов массива:
/* let arr = [1, 2, 3, 4, 5];
console.log(arr[0] + arr[1] + arr[2] + arr[3] + arr[4]); */

//Код должен вывести длину массива:
/* let arr = [1, 2, 3, 4, 5];
console.log(arr.length); */

//Код должен вывести длину массива:
/* let arr = [1, 2, 3, 4, 5];
console.log(arr.length); */
