//Найдите количество секунд в сутках.
console.log(60 ** 2 * 24); //86400
//Найдите количество секунд в 30 сутках.
console.log(60 ** 2 * 24 * 30); //2592000
//Найдите количество секунд в году.
console.log(60 ** 2 * 24 * 365); //31536000
//Найдите количество минут в сутках.
console.log(60 * 24); //1440
//Найдите количество минут в году.
console.log(60 * 24 * 365); //525600
//Найдите количество байт в мегабайте.
console.log(1024 ** 2); //1048546
//Найдите количество байт в гигабайте.
console.log(1024 ** 3); //1073741824
//Найдите количество байт в 10 гигабайтах.
console.log(1024 ** 3 * 10); //10737418240
//Найдите количество байт в терабайте.
console.log(1024 ** 4); //1099511627776
//Найдите количество килобайт в терабайте.
console.log(1024 ** 3); //1073741824
